api/spec/fixtures/stripe/2024-09-30.acacia/webhooks/payment_intent_canceled.json

{
  "id": "evt_3SVCroQ8iJWBZFaM2GyG1PVP",
  "object": "event",
  "api_version": "2024-09-30.acacia",
  "created": 1763738710,
  "data": {
    "object": {
      "id": "pi_3SVCroQ8iJWBZFaM22iaIuU3",
      "object": "payment_intent",
      "amount": 23040,
      "amount_capturable": 0,
      "amount_details": {
        "tip": {}
      },
      "amount_received": 0,
      "application": null,
      "application_fee_amount": null,
      "automatic_payment_methods": null,
      "canceled_at": 1763738710,
      "cancellation_reason": "duplicate",
      "capture_method": "automatic_async",
      "client_secret": "pi_3SVCroQ8iJWBZFaM22iaIuU3_secret_wMcPlg3I0vg6axAwII8B1HOVv",
      "confirmation_method": "automatic",
      "created": 1763564420,
      "currency": "usd",
      "customer": "cus_TOlZpKcK7V4tSl",
      "description": "Hooli - Invoice HOO-156A-028-011",
      "excluded_payment_method_types": null,
      "invoice": null,
      "last_payment_error": null,
      "latest_charge": null,
      "livemode": false,
      "metadata": {
        "invoice_type": "one_off",
        "lago_customer_id": "edde4cc9-a9d7-4e33-bc12-a81476684bf2",
        "lago_payment_id": "8f1e4ee4-301b-4332-8815-f699878a853c",
        "lago_payable_type": "Invoice",
        "lago_billing_entity_id": "516ab92d-1975-4cca-a688-1bf23d22156a",
        "lago_payable_id": "b5757d8a-347a-4149-a5fa-3fd9f5154a04",
        "invoice_issuing_date": "2025-11-19",
        "lago_invoice_id": "b5757d8a-347a-4149-a5fa-3fd9f5154a04",
        "lago_organization_id": "11111111-2222-3333-4444-555555555555"
      },
      "next_action": null,
      "on_behalf_of": null,
      "payment_method": "pm_1SRyLyQ8iJWBZFaMEvqtm6U6",
      "payment_method_configuration_details": null,
      "payment_method_options": {
        "card": {
          "installments": null,
          "mandate_options": null,
          "network": null,
          "request_three_d_secure": "automatic"
        },
        "us_bank_account": {
          "mandate_options": {},
          "verification_method": "automatic"
        }
      },
      "payment_method_types": [
        "card",
        "us_bank_account"
      ],
      "processing": null,
      "receipt_email": null,
      "review": null,
      "setup_future_usage": null,
      "shipping": null,
      "source": null,
      "statement_descriptor": null,
      "statement_descriptor_suffix": null,
      "status": "canceled",
      "transfer_data": null,
      "transfer_group": null
    }
  },
  "livemode": false,
  "pending_webhooks": 5,
  "request": {
    "id": "req_Eo1OhTrnHDS81N",
    "idempotency_key": "0b7e3cfb-5084-4f1b-abd8-b4172e5df135"
  },
  "type": "payment_intent.canceled"
}
