api/spec/fixtures/stripe/2025-04-30.basil/webhooks/payment_intent_payment_failed.json

{
  "id": "evt_3SVvxMQ8iJWBZFaM1z5wZ6Za",
  "object": "event",
  "api_version": "2025-04-30.basil",
  "created": 1763737745,
  "data": {
    "object": {
      "id": "pi_3SVvxMQ8iJWBZFaM1Lao8ehu",
      "object": "payment_intent",
      "amount": 11880,
      "amount_capturable": 0,
      "amount_details": {
        "tip": {}
      },
      "amount_received": 0,
      "application": null,
      "application_fee_amount": null,
      "automatic_payment_methods": null,
      "canceled_at": null,
      "cancellation_reason": null,
      "capture_method": "automatic_async",
      "client_secret": "pi_3SVvxMQ8iJWBZFaM1Lao8ehu_secret_fwMspul9uxTskxWVJekMXcffk",
      "confirmation_method": "automatic",
      "created": 1763737744,
      "currency": "usd",
      "customer": "cus_TSOWyTkxXlWiTc",
      "description": "Hooli - Invoice HOO-156A-030-005",
      "excluded_payment_method_types": null,
      "last_payment_error": {
        "code": "authentication_required",
        "decline_code": "authentication_not_handled",
        "doc_url": "https://stripe.com/docs/error-codes/authentication-required",
        "message": "This payment required an authentication action to complete, but `error_on_requires_action` was set. When you're ready, you can upgrade your integration to handle actions at https://stripe.com/docs/payments/payment-intents/upgrade-to-handle-actions.",
        "payment_method": {
          "id": "pm_1SVTn7Q8iJWBZFaMgjl33y0O",
          "object": "payment_method",
          "allow_redisplay": "always",
          "billing_details": {
            "address": {
              "city": null,
              "country": "FR",
              "line1": null,
              "line2": null,
              "postal_code": null,
              "state": null
            },
            "email": "gagerg@sfsefs.csrkgjsdbrgjdrbg",
            "name": "awdawd",
            "phone": null,
            "tax_id": null
          },
          "card": {
            "brand": "visa",
            "checks": {
              "address_line1_check": null,
              "address_postal_code_check": null,
              "cvc_check": "pass"
            },
            "country": "IE",
            "display_brand": "visa",
            "exp_month": 2,
            "exp_year": 2029,
            "fingerprint": "eumCxi1ZFoTDYqvg",
            "funding": "credit",
            "generated_from": null,
            "last4": "3220",
            "networks": {
              "available": [
                "visa"
              ],
              "preferred": null
            },
            "regulated_status": "unregulated",
            "three_d_secure_usage": {
              "supported": true
            },
            "wallet": null
          },
          "created": 1763629477,
          "customer": "cus_TSOWyTkxXlWiTc",
          "livemode": false,
          "metadata": {},
          "type": "card"
        },
        "type": "card_error"
      },
      "latest_charge": "ch_3SVvxMQ8iJWBZFaM1YEcxCs2",
      "livemode": false,
      "metadata": {
        "invoice_type": "one_off",
        "lago_customer_id": "8adce609-5e68-4f3b-acf2-cdc9ee6609fd",
        "lago_payment_id": "6a20520f-2047-4170-8282-a628197dd9ff",
        "lago_payable_type": "Invoice",
        "lago_billing_entity_id": "516ab92d-1975-4cca-a688-1bf23d22156a",
        "lago_payable_id": "7fd56270-c904-422c-b48c-c2eced9b569f",
        "invoice_issuing_date": "2025-11-21",
        "lago_invoice_id": "7fd56270-c904-422c-b48c-c2eced9b569f",
        "lago_organization_id": "11111111-2222-3333-4444-555555555555"
      },
      "next_action": null,
      "on_behalf_of": null,
      "payment_method": null,
      "payment_method_configuration_details": null,
      "payment_method_options": {
        "card": {
          "installments": null,
          "mandate_options": null,
          "network": null,
          "request_three_d_secure": "automatic"
        }
      },
      "payment_method_types": [
        "card"
      ],
      "processing": null,
      "receipt_email": null,
      "review": null,
      "setup_future_usage": null,
      "shipping": null,
      "source": null,
      "statement_descriptor": null,
      "statement_descriptor_suffix": null,
      "status": "requires_payment_method",
      "transfer_data": null,
      "transfer_group": null
    }
  },
  "livemode": false,
  "pending_webhooks": 3,
  "request": {
    "id": "req_ugAfLhYwxZ3saC",
    "idempotency_key": "payment-6a20520f-2047-4170-8282-a628197dd9ff"
  },
  "type": "payment_intent.payment_failed"
}
